                                                Chap 1 :- Pandas
                
➡ Pandas Series(1D):- 
        1> Tuple()
        2> Dictionary{}

In [13]:
#1> Tuple
import pandas as pd
a = (1,7,2,5)
s = pd.Series(a)
# s = pd.Series(a,index = ['x','y','z','w'])      # For Index from x,y,z,w
print(s)
print(s[0])
print(s[1])
print(s[2])

0    1
1    7
2    2
3    5
dtype: int64
1
7
2

In [3]:
#2> Dictionary
data = {"day1" : 420,"day2":390,"day3":330}
s = pd.Series(data)
print(s)

day1    420
day2    390
day3    330
dtype: int64

➡ Data Frame(2D) :- 
        1> by using dictionary
        2> by using CSV file

In [8]:
# 1> by using dictionary
data = {"A":[1,2,4],"B":[5,6,8],"C":[9,7,5]}
df = pd.DataFrame(data)
df # OR ➡ print(df)

   A  B  C
0  1  5  9
1  2  6  7
2  4  8  5

In [16]:
df.loc[0:1]

   A  B  C
0  1  5  9
1  2  6  7

In [18]:
df[["B"]]

   B
0  5
1  6
2  8

In [26]:
df[["B","C"]]

   B  C
0  5  9
1  6  7
2  8  5

In [32]:
df[["B","C"]].loc[1:2]

   B  C
1  6  7
2  8  5

In [37]:
# 2> By using CSV File
import pandas as pd
df = pd.read_csv("auto-mpg.csv")
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [38]:
df.info()    #for get Information of csv file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [39]:
df.head()  #default : First 5 line of csv file

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [40]:
df.head(9)   #First 5 line of csv file

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
5,15.0,8,429.0,198,4341,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220,4354,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225,4425,10.0,70,1,pontiac catalina

In [41]:
df.tail()        #default : Last 5 line of csv file

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [46]:
df.tail(7)    #First 7 line of csv file

      mpg
391  36.0
392  27.0
393  27.0
394  44.0
395  32.0
396  28.0
397  31.0

In [47]:
df[["model year","origin","car name"]].loc[101:110]

     model year  origin                  car name
101          73       1           plymouth duster
102          73       2   volkswagen super beetle
103          73       1          chevrolet impala
104          73       1              ford country
105          73       1    plymouth custom suburb
106          73       1  oldsmobile vista cruiser
107          73       1               amc gremlin
108          73       3             toyota carina
109          73       1            chevrolet vega
110          73       3                datsun 610